Programming/seqlock.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SeqLock</title>
<meta name="author" content="Dean Seo (deaniac.seo@gmail.com)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SeqLock</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgca2e764">Table of Contents</a></li>
<li><a href="#what-is-seqlock-and-how-it-works">What is SeqLock and how it works</a>
<ul>
<li><a href="#actual-code">Actual code</a></li>
<li><a href="#how-it-works">How it works</a></li>
<li><a href="#caveats">Caveats</a>
<ul>
<li><a href="#single-writer-only">Single Writer Only</a></li>
<li><a href="#relaxed-operation-might-be-sufficient-in-x86">Relaxed operation might be sufficient in x86</a></li>
<li><a href="#what-prevents-the-store-on-value_-from-being-reordered-with-start_seq">What prevents the store on <code>value_</code> from being reordered with <code>start_seq</code>?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgca2e764" class="outline-2">
<h2 id="orgca2e764">Table of Contents</h2>
<div class="outline-text-2" id="text-orgca2e764">
<ul class="org-ul">
<li><a href="#what-is-seqlock-and-how-it-works">What is SeqLock and how it works</a>
<ul class="org-ul">
<li><a href="#actual-code">Actual code</a></li>
<li><a href="#how-it-works">How it works</a></li>
<li><a href="#caveats">Caveats</a>
<ul class="org-ul">
<li><a href="#single-writer-only">Single Writer Only</a></li>
<li><a href="#relaxed-operation-might-be-sufficient-in-x86">Relaxed operation might be sufficient in x86</a></li>
<li><a href="#what-prevents-the-store-on-value_-from-being-reordered-with-start_seq">What prevents the store on value_ from being reordered with start<sub>seq</sub>?</a></li>
</ul></li>
</ul></li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-what-is-seqlock-and-how-it-works" class="outline-2">
<h2 id="what-is-seqlock-and-how-it-works">What is SeqLock and how it works</h2>
<div class="outline-text-2" id="text-what-is-seqlock-and-how-it-works">
<p>
Before I begin, I must say <b>SeqLock</b> is one of my favorite lock-free algorithms.
Why? Because it works in a really clever and simple way!
</p>

<p>
Just like any other lock mechanisms, <b>SeqLock</b> is to provide the concurrency of multiple writes and reads without <a href="https://stackoverflow.com/q/14011849/921070">having to lock</a> any thread.
Furthermore, it also gives us good materials to think about, such as <a href="https://en.cppreference.com/w/cpp/atomic/memory_order">Memory Order</a> in C++, for educational purposes.
</p>

<p>
Let's look at the actual code first. Then we will break it down.
</p>
</div>
<div id="outline-container-actual-code" class="outline-3">
<h3 id="actual-code">Actual code</h3>
<div class="outline-text-3" id="text-actual-code">
<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">template</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>                                  
<span class="org-keyword">struct</span> <span class="org-keyword">alignas</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::hardware_destructive_interference_size<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-type">seq_lock</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-rainbow-delimiters-depth-2">[</span><span class="org-rainbow-delimiters-depth-3">[</span>nodiscard<span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">]</span> <span class="org-keyword">auto</span> load<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">T</span>&amp; <span class="org-variable-name">required</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-keyword">const</span> <span class="org-keyword">noexcept</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-constant">true</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">{</span>
            <span class="org-keyword">const</span> <span class="org-keyword">auto</span> s0 = seq_.load<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">std</span>::memory_order_acquire<span class="org-rainbow-delimiters-depth-4">)</span>;
            <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-4">(</span>s0 &amp; 1<span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-rainbow-delimiters-depth-4">{</span> <span class="org-keyword">return</span> <span class="org-constant">false</span>; <span class="org-rainbow-delimiters-depth-4">}</span>

            <span class="org-constant">std</span>::<span class="org-type">atomic_ref</span><span class="org-rainbow-delimiters-depth-4">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-4">&gt;</span> <span class="org-variable-name">ref</span> <span class="org-rainbow-delimiters-depth-4">{</span> required <span class="org-rainbow-delimiters-depth-4">}</span>;
            ref.store<span class="org-rainbow-delimiters-depth-4">(</span>value_.load<span class="org-rainbow-delimiters-depth-5">(</span><span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-5">)</span>, <span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-4">)</span>;

            <span class="org-keyword">return</span> s0 == seq_.load<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">std</span>::memory_order_acquire<span class="org-rainbow-delimiters-depth-4">)</span>;
        <span class="org-rainbow-delimiters-depth-3">}</span>
    <span class="org-rainbow-delimiters-depth-2">}</span>

    <span class="org-type">void</span> <span class="org-variable-name">store</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> T value<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-keyword">noexcept</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">const</span> <span class="org-keyword">auto</span> <span class="org-variable-name">start_seq</span> = seq_.load<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-3">)</span>;
        seq_.store<span class="org-rainbow-delimiters-depth-3">(</span>start_seq + 1, <span class="org-constant">std</span>::memory_order_release<span class="org-rainbow-delimiters-depth-3">)</span>;
        value_.store<span class="org-rainbow-delimiters-depth-3">(</span>value, <span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-3">)</span>;
        seq_.store<span class="org-rainbow-delimiters-depth-3">(</span>start_seq + 2, <span class="org-constant">std</span>::memory_order_release<span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-keyword">private</span>:
    <span class="org-constant">std</span>::<span class="org-type">atomic</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">std</span>::uint64_t<span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">seq_</span> = 0;
    <span class="org-constant">std</span>::<span class="org-type">atomic</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">value_</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-how-it-works" class="outline-3">
<h3 id="how-it-works">How it works</h3>
<div class="outline-text-3" id="text-how-it-works">
<p>
SeqLock, short for Sequence Lock, is a synchronization mechanism that operates using a sequence counter that monitors updates to the data:
</p>
<pre class="example" id="org2294b3a">
Sequence Counter: 0 (even - no write in progress)
      |
      v
+-----+-----+
| Writer    |---(1)--&gt; Increments counter to 1 (odd - write in progress)
+-----------+                |
                             v
                         (2) Writes data
                             |
                             v
                    Increments counter to 2 (even - write complete)
                             |
      +----------------------+
      |
      v
+-----+-----------------+
| Readers               |-----&gt; (3) Checks counter (even, proceed to read)
+-----------------------+      |
| - Reader 1 reads data |&lt;-----+
| - Reader 2 reads data |      |---(4) If counter changed or odd during read, retry.
| - Reader 3 reads data |&lt;-----+
+-----------------------+
</pre>

<p>
When a writer wishes to update the shared data, it first increments the counter to an odd value, signaling that a write operation is in progress. 
After the write is completed, the counter is incremented again to an even number, indicating that the data is stable and valid for reading. 
</p>

<p>
Readers, on the other hand, check the counter before and after they access the data. If the counter value is odd or changes between their two checks, 
it suggests the shared data is corrupted due to a concurrent write.
</p>

<p>
The benefits of this mechanism is that it minimizes the locking overhead for writers.
</p>
</div>
</div>

<div id="outline-container-caveats" class="outline-3">
<h3 id="caveats">Caveats</h3>
<div class="outline-text-3" id="text-caveats">
</div>
<div id="outline-container-single-writer-only" class="outline-4">
<h4 id="single-writer-only">Single Writer Only</h4>
<div class="outline-text-4" id="text-single-writer-only">
<p>
The implementation above only supports a single writer because <code>store</code> doesn't verify its read,
presuming that there's only one writer (itself) incrementing the sequence.
</p>

<p>
<code>store</code> doesn't use a RMW(read-modify-write) operation so there's no lock emitted in instructuion level.
The current implementation only takes care of memory orders and atomicity on <code>seq_</code>.
As long as these conditions are met, there's no lock instruction or full memmory fence emitted.
</p>

<p>
That being said, if there are more than one writer thread running, it's advisible to look for a different lock-free structure, which I can hopefully post about in future.
</p>
</div>
</div>

<div id="outline-container-relaxed-operation-might-be-sufficient-in-x86" class="outline-4">
<h4 id="relaxed-operation-might-be-sufficient-in-x86">Relaxed operation might be sufficient in x86</h4>
<div class="outline-text-4" id="text-relaxed-operation-might-be-sufficient-in-x86">
<p>
In x86, every store is a release store and every load is a release load.
The legacy <code>MOV</code> instruction is guaranteed to be atomic.
</p>

<p>
In other words, we only need to worry about reordering done by the compiler so using a relaxed operation on <code>seq_</code> (or a naive `int` type) with compiler barriers is probably sufficient if we don't care about keeping it portable.
</p>
</div>
</div>

<div id="outline-container-what-prevents-the-store-on-value_-from-being-reordered-with-start_seq" class="outline-4">
<h4 id="what-prevents-the-store-on-value_-from-being-reordered-with-start_seq">What prevents the store on <code>value_</code> from being reordered with <code>start_seq</code>?</h4>
<div class="outline-text-4" id="text-what-prevents-the-store-on-value_-from-being-reordered-with-start_seq">
<p>
One could wonder how <code>value_</code> in <code>store</code> isn't reordered with the upper store such that:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
seq_.store<span class="org-rainbow-delimiters-depth-1">(</span>start_seq + 1, <span class="org-constant">std</span>::memory_order_release<span class="org-rainbow-delimiters-depth-1">)</span>;
value_.store<span class="org-rainbow-delimiters-depth-1">(</span>value, <span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-1">)</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#8593; : reordered with the preceding store</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
</pre>
</div>

<p>
This is probably not guaranteed by the C++ standard's memory model, though the compiler already writes the correct order, as follows:
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-function-name">mov</span>     <span class="org-keyword">QWORD</span> PTR [rax], rsi <span class="org-comment-delimiter">// </span><span class="org-comment">seq_.store(start_seq + 1, std::memory_order_release);</span>
<span class="org-function-name">mov</span>     <span class="org-keyword">DWORD</span> PTR [rax+8], ecx <span class="org-comment-delimiter">// </span><span class="org-comment">value_ = value</span>
<span class="org-function-name">mov</span>     <span class="org-keyword">QWORD</span> PTR [rax], rdx <span class="org-comment-delimiter">// </span><span class="org-comment">seq_.store(start_seq + 2, std::memory_order_release);</span>
</pre>
</div>

<p>
My presumtion is that a store barrier in the modern system including X86 generally has a by-default <a href="https://www.kernel.org/doc/Documentation/memory-barriers.txt">trait of a release store</a> where <span class="underline">subsequent stores are sequential</span> so there's no <i>accidential</i> reorder that can be caught.
</p>
<div class="note" id="orgda69cde">
<p>
Of course, the minimal prerequisites are that the <i>subsequent stores</i> must be of a atomic type, always.
</p>

</div>

<p>
The same presumption can be applied for the case of <code>load</code>, as follows:
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-comment-delimiter">// </span><span class="org-comment">rax == s0</span>
<span class="org-function-name">mov</span>     <span class="org-keyword">rax</span>, QWORD PTR [rsp+128] <span class="org-comment-delimiter">// </span><span class="org-comment">s0 = seq_.load(std::memory_order_acquire)</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">if (s0 &amp; 1)</span>
<span class="org-function-name">test</span>    <span class="org-keyword">al</span>, 1 
<span class="org-function-name">jne</span>     .L27  <span class="org-comment-delimiter">// </span><span class="org-comment">inlined, in this case</span>
<span class="org-function-name">mov</span>     <span class="org-keyword">edx</span>, DWORD PTR [rsp+136] <span class="org-comment-delimiter">// </span><span class="org-comment">value_.load(std::memory_order_relaxed)</span>
<span class="org-function-name">mov</span>     <span class="org-keyword">DWORD</span> PTR [rsp+120], edx <span class="org-comment-delimiter">// </span><span class="org-comment">ref.store(..., std::memory_order_relaxed)</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">if inlined, rax and rdx registers can be used to check if the load is valid directly such that:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">cmp rax rdx</span>
<span class="org-function-name">mov</span>     <span class="org-keyword">rdx</span>, QWORD PTR [rsp+128] <span class="org-comment-delimiter">// </span><span class="org-comment">another seq_.load(std::memory_order_acquire)</span>
</pre>
</div>

<p>
Plus, in contrast to <code>store</code>, the condition is acting as a <i>control dependency</i> so the reorder should be certainly prevented.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-conclusion" class="outline-2">
<h2 id="conclusion">Conclusion</h2>
<div class="outline-text-2" id="text-conclusion">
<p>
<b>SeqLock</b> is a simple and fast locking mechanism that doesn't block the writer.
That trait is especially useful when a thread has to constantly feeds tick data into other algo carriers.
</p>

<p>
Not only that, but also it's often used to solve many <i>real-world</i> problems and in fact part of the kernel in Linux as well.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-02-06 Sat 00:00</p>
<p class="author">Author: Dean Seo (deaniac.seo@gmail.com)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
